n = {'Програмування': 'передання комп’ютеру інструкцій, які вказують йому щось зробити. Наприклад, обчислити математичний вираз, змінити текст, здійснити пошук інформації у файлах або виконати обмін даними з іншими комп’ютерами через мережу Інтернет тощо.',
     'Програміст': 'фахівець, що займається програмуванням, виконує розробку програмного забезпечення (в простіших випадках – окремих програм) для програмованих пристроїв – комп’ютерів.',
     'Алгоритм': 'набір інструкцій, які описують порядок дій виконавця (комп’ютера, людини), для отримання результату розв’язання задачі за скінченну кількість дій.',
     'Програма': 'набір команд (вказівок, інструкцій), призначений для виконання комп’ютером у певній послідовності. Такий набір інструкцій називається вихідним кодом.',
     'Мова програмування': 'мова, яка використовується для запису алгоритмів, призначених для виконання комп’ютером.',
     'Скрипт': 'програма, яка автоматизує деяке завдання.'}
for i in n.keys():
    print('\t',i,'-',n[i],'\n')
