print('Введіть два значення, будь ласка.')
value01 = input('Значення 1:\n')
value02 = input('Значення 2:\n')
try:
    value1 = float(value01)
    print('Перше введене значення - число.')
    try:
        value2 = float(value02)
        print('Друге введене значення - число.\n\
Ви ввели два числа. Виведемо їхню суму:')
        print(value1,' + ',value2,' = ',value1+value2)
    except ValueError:
        print('Друге введене значення - текстове.')
        print("\nВи щось переплутали з введенням\n\
Одне з введених вами значень було не числом, а текстом,\n\
тож уявлення не маю, що мені з цим робити...\n\
Ну гаразд, виведу їх вам ще раз.\n\
Навіть об'єднаю, як текст.")
        print('"',value01,'"',' + ','"',value02,'"',' = ','"',value01+value02,'"')
except ValueError:
    print('Перше введене значення - текстове.')
    try:
        value2 = float(value02)
        print('Друге введене значення - число.')
        print("\nВи щось переплутали з введенням\n\
Одне з введених вами значень було не числом, а текстом,\n\
тож уявлення не маю, що мені з цим робити...\n\
Ну гаразд, виведу їх вам ще раз.\n\
Навіть об'єднаю, як текст.")
        print('"',value01,'"',' + ','"',value02,'"',' = ','"',value01+value02,'"')
    except ValueError:
        print('Друге введене значення - текстове.')
        print("\nВи щось переплутали з введенням\n\
Обидва з введених вами значень було не числом,\n\
а текстом, тож проведемо конкатенацію (злиття рядків).")
        print('"',value01,'"',' + ','"',value02,'"',' = ','"',value01+value02,'"')




